[Killed] ConditionalExpression
punybind.js:42:9
 
   const bindTextNode = (node, bindings, options) => {
     const valueFactory = safeCompileComposite(node.nodeValue, options)
-    if (valueFactory) {
+    if (false) {
       const parent = node.parentNode
       let value
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -5,11 +5,11 @@
          "before",
        ],

[Killed] ConditionalExpression
punybind.js:62:9
 
   const bindAttribute = (node, name, bindings, options) => {
     const valueFactory = safeCompileComposite(attr(node, name), options)
-    if (valueFactory) {
+    if (true) {
       let value
 
killedBy: conditional {{if}} ignores invalid syntax: <div {{if}}="" />
statusReason: TypeError: valueFactory is not a function

[Timeout] BlockStatement
punybind.js:77:60
     }
   }
 
-  const addToTemplate = (node, attributeName, template) => {
-    const { nextElementSibling } = node
-    template.appendChild(node)
-    node.removeAttribute(attributeName)
-    return nextElementSibling
-  }
+  const addToTemplate = (node, attributeName, template) => {}
 
   const getTemplate = (node, attributeName) => {

[Killed] BlockStatement
punybind.js:84:48
     return nextElementSibling
   }
 
-  const getTemplate = (node, attributeName) => {
-    const parent = node.parentNode
-    const template = node.ownerDocument.createElement('template')
-    parent.insertBefore(template, node)
-    addToTemplate(node, attributeName, template)
-    return [parent, template]
-  }
+  const getTemplate = (node, attributeName) => {}
 
   const CLONE = 0
killedBy: reactive model model property exposes a model property
statusReason: TypeError: getTemplate is not a function or its return value is not iterable

[Killed] BlockStatement
punybind.js:95:66
   const CLONE = 0
   const BINDINGS = 1
 
-  const instantiate = (template, changes, options, index = 0) => {
-    let elementToClone = template.firstElementChild
-    while (index-- > 0) {
-      elementToClone = elementToClone.nextElementSibling
-    }
-    const clone = elementToClone.cloneNode(true)
-    changes.push(function () {
-      template.parentNode.insertBefore(clone, template)
-    })
-    return [
-      clone,
-      parse(clone, options)
-    ]
-  }
+  const instantiate = (template, changes, options, index = 0) => {}
 
   const remove = (parent, instances, changes) => {
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
punybind.js:97:12
 
   const instantiate = (template, changes, options, index = 0) => {
     let elementToClone = template.firstElementChild
-    while (index-- > 0) {
+    while (false) {
       elementToClone = elementToClone.nextElementSibling
     }
killedBy: conditional {{if}} {{if}} / {{elseif}} skipping condition remainder on first truthy condition processes only second condition
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -5,11 +5,11 @@
          "before",
        ],

[Killed] EqualityOperator
punybind.js:97:12
 
   const instantiate = (template, changes, options, index = 0) => {
     let elementToClone = template.firstElementChild
-    while (index-- > 0) {
+    while (index-- <= 0) {
       elementToClone = elementToClone.nextElementSibling
     }
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: Cannot read properties of null (reading 'nextElementSibling')

[Killed] BooleanLiteral
punybind.js:100:44
     while (index-- > 0) {
       elementToClone = elementToClone.nextElementSibling
     }
-    const clone = elementToClone.cloneNode(true)
+    const clone = elementToClone.cloneNode(false)
     changes.push(function () {
       template.parentNode.insertBefore(clone, template)
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 1

@@ -4,13 +4,11 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:101:30
       elementToClone = elementToClone.nextElementSibling
     }
     const clone = elementToClone.cloneNode(true)
-    changes.push(function () {
-      template.parentNode.insertBefore(clone, template)
-    })
+    changes.push(function () {})
     return [
       clone,
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 4

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] Regex
punybind.js:120:19
 
   const bindIterator = (node, bindings, options) => {
     const forValue = attr(node, $for)
-    const match = /^\s*(\w+)(?:\s*,\s*(\w+))?\s+of\s(.*)/.exec(forValue)
+    const match = /^\s*(\w+)(?:\S*,\s*(\w+))?\s+of\s(.*)/.exec(forValue)
     if (!match) {
       return
killedBy: iterators {{for}} ignores invalid syntax: <div {{for}}="item-, index of items" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] Regex
punybind.js:120:19
 
   const bindIterator = (node, bindings, options) => {
     const forValue = attr(node, $for)
-    const match = /^\s*(\w+)(?:\s*,\s*(\w+))?\s+of\s(.*)/.exec(forValue)
+    const match = /^\s*(\w+)(?:\s*,\s*(\w+))\s+of\s(.*)/.exec(forValue)
     if (!match) {
       return
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}=" item of items" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
punybind.js:126:9
     }
     const [, valueName, indexName, iterator] = match
     const iteratorFactory = safeCompile(iterator, options)
-    if (!iteratorFactory) {
+    if (true) {
       return
     }
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}=" item of items" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
punybind.js:139:41
       for await (const item of iterator) {
         ++index
 
-        if (index === instances.length) {
-          instances.push(instantiate(template, changes, options))
-        }
+        if (index === instances.length) {}
 
         await collectChanges(
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] StringLiteral
punybind.js:162:19
   }
 
   const $if = '{{if}}'
-  const $elseif = '{{elseif}}'
+  const $elseif = ""
   const $else = '{{else}}'
 
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  0
+ Received  + 24

@@ -7,10 +7,34 @@
      },
      Object {

[Killed] StringLiteral
punybind.js:163:17
 
   const $if = '{{if}}'
   const $elseif = '{{elseif}}'
-  const $else = '{{else}}'
+  const $else = ""
 
   const INSTANCE = 1
killedBy: conditional {{if}} {{if}} / {{else}} generates only one binding
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  2
+ Received  + 12

@@ -4,14 +4,24 @@
        "h1": Array [
          "before",

[Killed] BooleanLiteral
punybind.js:169:9
 
   const bindConditional = (node, bindings, options) => {
     const valueFactory = safeCompile(attr(node, $if), options)
-    if (!valueFactory) {
+    if (valueFactory) {
       return
     }
killedBy: conditional {{if}} ignores invalid syntax: <div {{if}}="-" />
statusReason: TypeError: valueFactory is not a function

[Killed] ArrayDeclaration
punybind.js:176:31
     let nextSibling = node.nextElementSibling
     const [parent, template] = getTemplate(node, $if)
 
-    const conditionalChain = [[valueFactory]]
+    const conditionalChain = [[]]
 
     while (nextSibling) {
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: valueFactory is not a function

[Killed] ConditionalExpression
punybind.js:178:12
 
     const conditionalChain = [[valueFactory]]
 
-    while (nextSibling) {
+    while (false) {
       const elseIf = attr(nextSibling, $elseif)
       if (elseIf) {
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  0
+ Received  + 24

@@ -7,10 +7,34 @@
      },
      Object {

[Timeout] BlockStatement
punybind.js:178:25
 
     const conditionalChain = [[valueFactory]]
 
-    while (nextSibling) {
-      const elseIf = attr(nextSibling, $elseif)
-      if (elseIf) {
-        const eiValueFactory = safeCompile(elseIf, options)
-        if (!eiValueFactory) {
-          break
-        }
-        conditionalChain.push([eiValueFactory])
-        nextSibling = addToTemplate(nextSibling, $elseif, template)
-      } else {
-        if (nextSibling.hasAttribute($else)) {
-          addToTemplate(nextSibling, $else, template)
-          conditionalChain.push([() => true])
-        }
-        break
-      }
-    }
+    while (nextSibling) {}
 
     bindings.push(async (context, changes) => {

[Killed] ConditionalExpression
punybind.js:180:11
 
     while (nextSibling) {
       const elseIf = attr(nextSibling, $elseif)
-      if (elseIf) {
+      if (true) {
         const eiValueFactory = safeCompile(elseIf, options)
         if (!eiValueFactory) {
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 5
+ Received  + 0

@@ -6,12 +6,7 @@
        ],
      },

[Killed] BlockStatement
punybind.js:182:30
       const elseIf = attr(nextSibling, $elseif)
       if (elseIf) {
         const eiValueFactory = safeCompile(elseIf, options)
-        if (!eiValueFactory) {
-          break
-        }
+        if (!eiValueFactory) {}
         conditionalChain.push([eiValueFactory])
         nextSibling = addToTemplate(nextSibling, $elseif, template)
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}="-"></div>
statusReason: TypeError: valueFactory is not a function

[Killed] ArrayDeclaration
punybind.js:185:31
         if (!eiValueFactory) {
           break
         }
-        conditionalChain.push([eiValueFactory])
+        conditionalChain.push([])
         nextSibling = addToTemplate(nextSibling, $elseif, template)
       } else {
killedBy: compiler conditional generates only one binding
statusReason: TypeError: valueFactory is not a function

[Timeout] BlockStatement
punybind.js:187:14
         }
         conditionalChain.push([eiValueFactory])
         nextSibling = addToTemplate(nextSibling, $elseif, template)
-      } else {
-        if (nextSibling.hasAttribute($else)) {
-          addToTemplate(nextSibling, $else, template)
-          conditionalChain.push([() => true])
-        }
-        break
-      }
+      } else {}
     }
 

[Killed] ConditionalExpression
punybind.js:188:13
         conditionalChain.push([eiValueFactory])
         nextSibling = addToTemplate(nextSibling, $elseif, template)
       } else {
-        if (nextSibling.hasAttribute($else)) {
+        if (true) {
           addToTemplate(nextSibling, $else, template)
           conditionalChain.push([() => true])
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 12

@@ -4,14 +4,25 @@
        "h1": Array [
          "before",

[Killed] ArrowFunction
punybind.js:190:34
       } else {
         if (nextSibling.hasAttribute($else)) {
           addToTemplate(nextSibling, $else, template)
-          conditionalChain.push([() => true])
+          conditionalChain.push([() => undefined])
         }
         break
killedBy: conditional {{if}} {{if}} / {{else}} generates only one binding
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  2
+ Received  + 10

@@ -4,14 +4,22 @@
        "h1": Array [
          "before",

[Killed] BooleanLiteral
punybind.js:190:40
       } else {
         if (nextSibling.hasAttribute($else)) {
           addToTemplate(nextSibling, $else, template)
-          conditionalChain.push([() => true])
+          conditionalChain.push([() => false])
         }
         break
killedBy: conditional {{if}} {{if}} / {{else}} generates only one binding
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  2
+ Received  + 10

@@ -4,14 +4,22 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:196:47
       }
     }
 
-    bindings.push(async (context, changes) => {
-      let searchTrueCondition = true
-      const instancesToRemove = []
-      let index = -1
-      for (const condition of conditionalChain) {
-        ++index
-        const [valueFactory, instance] = condition
-
-        const value = searchTrueCondition && valueFactory(context)
-        if (value) {
-          searchTrueCondition = false
-          if (!instance) {
-            condition[INSTANCE] = instantiate(template, changes, options, index)
-          }
-          await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
-          instancesToRemove.push(instance)
-          condition[INSTANCE] = undefined
-        }
-      }
-      remove(parent, instancesToRemove, changes)
-    })
+    bindings.push(async (context, changes) => {})
   }
 
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 4

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] UnaryOperator
punybind.js:199:19
     bindings.push(async (context, changes) => {
       let searchTrueCondition = true
       const instancesToRemove = []
-      let index = -1
+      let index = +1
       for (const condition of conditionalChain) {
         ++index
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: Cannot read properties of null (reading 'nextElementSibling')

[Killed] BlockStatement
punybind.js:200:49
       let searchTrueCondition = true
       const instancesToRemove = []
       let index = -1
-      for (const condition of conditionalChain) {
-        ++index
-        const [valueFactory, instance] = condition
-
-        const value = searchTrueCondition && valueFactory(context)
-        if (value) {
-          searchTrueCondition = false
-          if (!instance) {
-            condition[INSTANCE] = instantiate(template, changes, options, index)
-          }
-          await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
-          instancesToRemove.push(instance)
-          condition[INSTANCE] = undefined
-        }
-      }
+      for (const condition of conditionalChain) {}
       remove(parent, instancesToRemove, changes)
     })
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 4

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] UpdateOperator
punybind.js:201:9
       const instancesToRemove = []
       let index = -1
       for (const condition of conditionalChain) {
-        ++index
+        --index
         const [valueFactory, instance] = condition
 
killedBy: conditional {{if}} {{if}} / {{elseif}} skipping condition remainder on first truthy condition processes only second condition
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -5,11 +5,11 @@
          "before",
        ],

[Killed] ConditionalExpression
punybind.js:204:23
         ++index
         const [valueFactory, instance] = condition
 
-        const value = searchTrueCondition && valueFactory(context)
+        const value = false
         if (value) {
           searchTrueCondition = false
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 4

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:205:20
         const [valueFactory, instance] = condition
 
         const value = searchTrueCondition && valueFactory(context)
-        if (value) {
-          searchTrueCondition = false
-          if (!instance) {
-            condition[INSTANCE] = instantiate(template, changes, options, index)
-          }
-          await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
+        if (value) {} else if (instance) {
           instancesToRemove.push(instance)
           condition[INSTANCE] = undefined
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 4

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] ConditionalExpression
punybind.js:207:15
         const value = searchTrueCondition && valueFactory(context)
         if (value) {
           searchTrueCondition = false
-          if (!instance) {
+          if (true) {
             condition[INSTANCE] = instantiate(template, changes, options, index)
           }
killedBy: conditional {{if}} {{if}} only switching true -> true : creates only one instance
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 12

@@ -9,11 +9,22 @@
        "div": Array [
          "Hello World !",

[Killed] ConditionalExpression
punybind.js:211:20
             condition[INSTANCE] = instantiate(template, changes, options, index)
           }
           await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
+        } else if (false) {
           instancesToRemove.push(instance)
           condition[INSTANCE] = undefined
killedBy: conditional {{if}} {{if}} only switching true -> false : removes the instance
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 12

@@ -4,11 +4,22 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:223:30
   const parse = (root, options) => {
     const bindings = []
 
-    const traverse = node => {
-      if (node.nodeType === TEXT_NODE) {
-        bindTextNode(node, bindings, options)
-      }
-      if (node.nodeType === ELEMENT_NODE) {
-        if (attr(node, $for)) {
-          bindIterator(node, bindings, options)
-          return
-        }
-        if (attr(node, $if)) {
-          bindConditional(node, bindings, options)
-          return
-        }
-        for (const attr of node.attributes) {
-          bindAttribute(node, attr.name, bindings, options)
-        }
-        const childNodes = node.childNodes
-        let index = 0
-        while (index < childNodes.length) {
-          traverse(childNodes[index++])
-        }
-      }
-    }
+    const traverse = node => {}
 
     traverse(root)
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 14
+ Received  +  4

  Object {
    "body": Array [
      Object {

[Killed] EqualityOperator
punybind.js:224:11
     const bindings = []
 
     const traverse = node => {
-      if (node.nodeType === TEXT_NODE) {
+      if (node.nodeType !== TEXT_NODE) {
         bindTextNode(node, bindings, options)
       }
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot read properties of null (reading 'split')

[Killed] ConditionalExpression
punybind.js:227:11
       if (node.nodeType === TEXT_NODE) {
         bindTextNode(node, bindings, options)
       }
-      if (node.nodeType === ELEMENT_NODE) {
+      if (false) {
         if (attr(node, $for)) {
           bindIterator(node, bindings, options)
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 14
+ Received  +  4

  Object {
    "body": Array [
      Object {

[Killed] BlockStatement
punybind.js:232:30
           bindIterator(node, bindings, options)
           return
         }
-        if (attr(node, $if)) {
-          bindConditional(node, bindings, options)
-          return
-        }
+        if (attr(node, $if)) {}
         for (const attr of node.attributes) {
           bindAttribute(node, attr.name, bindings, options)
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 5

@@ -4,11 +4,15 @@
        "h1": Array [
          "before",

[Killed] ConditionalExpression
punybind.js:241:16
         }
         const childNodes = node.childNodes
         let index = 0
-        while (index < childNodes.length) {
+        while (false) {
           traverse(childNodes[index++])
         }
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 14
+ Received  +  4

  Object {
    "body": Array [
      Object {

[Killed] EqualityOperator
punybind.js:241:16
         }
         const childNodes = node.childNodes
         let index = 0
-        while (index < childNodes.length) {
+        while (index <= childNodes.length) {
           traverse(childNodes[index++])
         }
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot read properties of undefined (reading 'nodeType')

[Killed] UpdateOperator
punybind.js:242:31
         const childNodes = node.childNodes
         let index = 0
         while (index < childNodes.length) {
-          traverse(childNodes[index++])
+          traverse(childNodes[index--])
         }
       }
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot read properties of undefined (reading 'nodeType')

[Killed] ConditionalExpression
punybind.js:263:13
       get (obj, prop) {
         const value = obj[prop]
         const type = typeof value
-        if (type === 'object') {
+        if (true) {
           return observe(value, refresh)
         }
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot create proxy with a non-object as target or handler

[Killed] ConditionalExpression
punybind.js:270:13
       },
       set (obj, prop, value) {
         const previousValue = obj[prop]
-        if (previousValue !== value) {
+        if (true) {
           obj[prop] = value
           refresh()
killedBy: reactive model reactive behavior does not refresh if property value does not change
statusReason: Error: expect(received).toBe(expected) // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: {}
Received: serializes to the same string

[Killed] ArrayDeclaration
punybind.js:304:25
 
     const debounced = async () => {
       try {
-        const changes = []
+        const changes = ["Stryker was here"]
         await collectChanges(bindings, lastContext, changes)
         for (const change of changes) {
killedBy: text node text ignores invalid syntax: Title
statusReason: TypeError: change is not a function

[Killed] ConditionalExpression
punybind.js:317:11
     }
 
     const update = async (context) => {
-      if (lastContext === undefined) {
+      if (false) {
         setTimeout(debounced, 0)
         done = new Promise((resolve, reject) => {
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 4

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] ObjectLiteral
punybind.js:346:30
     const instance = punybind.bind(options)
     assignROProperties(instance, {
       version: '0.0.0',
-      use: addOptions => use({
-        ...options,
-        ...addOptions
-      })
+      use: addOptions => use({})
     })
     return instance
killedBy: compiler text node exposes a bindingsCount property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
