[Killed] ArrowFunction
punybind.js:5:27
   'use strict'
 
   // eslint-disable-next-line no-new-func
-  const defaultCompiler = expression => new Function(`return function(_){with (_){return ${expression}}}`)()
+  const defaultCompiler = () => undefined
 
   const safeCompile = (expression, { compiler }) => {
killedBy: conditional {{if}} ignores invalid syntax: <div {{if}}="-" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] StringLiteral
punybind.js:5:54
   'use strict'
 
   // eslint-disable-next-line no-new-func
-  const defaultCompiler = expression => new Function(`return function(_){with (_){return ${expression}}}`)()
+  const defaultCompiler = expression => new Function(``)()
 
   const safeCompile = (expression, { compiler }) => {
killedBy: conditional {{if}} ignores invalid syntax: <div {{if}}="-" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
punybind.js:7:53
   // eslint-disable-next-line no-new-func
   const defaultCompiler = expression => new Function(`return function(_){with (_){return ${expression}}}`)()
 
-  const safeCompile = (expression, { compiler }) => {
-    try {
-      const compiled = compiler(expression)
-      return function (context) {
-        let result
-        try {
-          result = compiled(context)
-        } catch (e) {
-          // ignore
-        }
-        if (result === undefined) {
-          return ''
-        }
-        return result
-      }
-    } catch (e) {
-      // ignore
-    }
-  }
+  const safeCompile = (expression, { compiler }) => {}
 
   const safeCompileComposite = (value, options) => {
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 6

@@ -4,11 +4,16 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:8:9
   const defaultCompiler = expression => new Function(`return function(_){with (_){return ${expression}}}`)()
 
   const safeCompile = (expression, { compiler }) => {
-    try {
-      const compiled = compiler(expression)
-      return function (context) {
-        let result
-        try {
-          result = compiled(context)
-        } catch (e) {
-          // ignore
-        }
-        if (result === undefined) {
-          return ''
-        }
-        return result
-      }
-    } catch (e) {
+    try {} catch (e) {
       // ignore
     }
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 6

@@ -4,11 +4,16 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:10:33
   const safeCompile = (expression, { compiler }) => {
     try {
       const compiled = compiler(expression)
-      return function (context) {
-        let result
-        try {
-          result = compiled(context)
-        } catch (e) {
-          // ignore
-        }
-        if (result === undefined) {
-          return ''
-        }
-        return result
-      }
+      return function (context) {}
     } catch (e) {
       // ignore
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}=" item of items" />
statusReason: TypeError: Cannot read properties of undefined (reading 'Symbol(Symbol.asyncIterator)')

[Killed] BlockStatement
punybind.js:12:13
       const compiled = compiler(expression)
       return function (context) {
         let result
-        try {
-          result = compiled(context)
-        } catch (e) {
+        try {} catch (e) {
           // ignore
         }
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 14
+ Received  +  5

  Object {
    "body": Array [
      Object {

[Killed] ConditionalExpression
punybind.js:17:13
         } catch (e) {
           // ignore
         }
-        if (result === undefined) {
+        if (false) {
           return ''
         }
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}=" item of items" />
statusReason: TypeError: Cannot read properties of undefined (reading 'Symbol(Symbol.asyncIterator)')

[Killed] ConditionalExpression
punybind.js:17:13
         } catch (e) {
           // ignore
         }
-        if (result === undefined) {
+        if (true) {
           return ''
         }
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 7
+ Received  + 3

@@ -4,21 +4,17 @@
        "h1": Array [
          "before",

[Killed] StringLiteral
punybind.js:18:18
           // ignore
         }
         if (result === undefined) {
-          return ''
+          return "Stryker was here!"
         }
         return result
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 12

@@ -4,11 +4,22 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:27:52
     }
   }
 
-  const safeCompileComposite = (value, options) => {
-    const parsed = value.split(/{{((?:[^}])+)}}/)
-    const escape = str => str.replace(/\\|'/g, match => ({ '\\': '\\\\', '\'': '\\\'' }[match]))
-    if (parsed.length > 1) {
-      return safeCompile(parsed.map((expr, idx) => idx % 2 ? `(${expr})` : `'${escape(expr)}'`).join('+'), options)
-    }
-  }
+  const safeCompileComposite = (value, options) => {}
 
   const ELEMENT_NODE = 1
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

@@ -5,16 +5,16 @@
          "before",
        ],

[Killed] Regex
punybind.js:28:32
   }
 
   const safeCompileComposite = (value, options) => {
-    const parsed = value.split(/{{((?:[^}])+)}}/)
+    const parsed = value.split(/{{((?:[}])+)}}/)
     const escape = str => str.replace(/\\|'/g, match => ({ '\\': '\\\\', '\'': '\\\'' }[match]))
     if (parsed.length > 1) {
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

@@ -5,16 +5,16 @@
          "before",
        ],

[Killed] ArrowFunction
punybind.js:29:20
 
   const safeCompileComposite = (value, options) => {
     const parsed = value.split(/{{((?:[^}])+)}}/)
-    const escape = str => str.replace(/\\|'/g, match => ({ '\\': '\\\\', '\'': '\\\'' }[match]))
+    const escape = () => undefined
     if (parsed.length > 1) {
       return safeCompile(parsed.map((expr, idx) => idx % 2 ? `(${expr})` : `'${escape(expr)}'`).join('+'), options)
killedBy: compiler text node evaluates and injects results
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Title is Hello World !."
Received: "undefinedHello World !undefined"

[Killed] ArrowFunction
punybind.js:29:48
 
   const safeCompileComposite = (value, options) => {
     const parsed = value.split(/{{((?:[^}])+)}}/)
-    const escape = str => str.replace(/\\|'/g, match => ({ '\\': '\\\\', '\'': '\\\'' }[match]))
+    const escape = str => str.replace(/\\|'/g, () => undefined)
     if (parsed.length > 1) {
       return safeCompile(parsed.map((expr, idx) => idx % 2 ? `(${expr})` : `'${escape(expr)}'`).join('+'), options)
killedBy: text node text properly escapes static strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "'\\\\'\\\\'"
Received: "undefinedundefined\\'\\undefinedundefined"

[Killed] EqualityOperator
punybind.js:30:9
   const safeCompileComposite = (value, options) => {
     const parsed = value.split(/{{((?:[^}])+)}}/)
     const escape = str => str.replace(/\\|'/g, match => ({ '\\': '\\\\', '\'': '\\\'' }[match]))
-    if (parsed.length > 1) {
+    if (parsed.length <= 1) {
       return safeCompile(parsed.map((expr, idx) => idx % 2 ? `(${expr})` : `'${escape(expr)}'`).join('+'), options)
     }
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 5
+ Received  + 5

@@ -1,28 +1,28 @@
  Object {
    "body": Array [

[Killed] EqualityOperator
punybind.js:30:9
   const safeCompileComposite = (value, options) => {
     const parsed = value.split(/{{((?:[^}])+)}}/)
     const escape = str => str.replace(/\\|'/g, match => ({ '\\': '\\\\', '\'': '\\\'' }[match]))
-    if (parsed.length > 1) {
+    if (parsed.length >= 1) {
       return safeCompile(parsed.map((expr, idx) => idx % 2 ? `(${expr})` : `'${escape(expr)}'`).join('+'), options)
     }
killedBy: iterators {{for}} ignores invalid syntax: <div {{for}}="" />
statusReason: InvalidCharacterError: "{{for}}" did not match the Name production

[Killed] ArrowFunction
punybind.js:31:37
     const parsed = value.split(/{{((?:[^}])+)}}/)
     const escape = str => str.replace(/\\|'/g, match => ({ '\\': '\\\\', '\'': '\\\'' }[match]))
     if (parsed.length > 1) {
-      return safeCompile(parsed.map((expr, idx) => idx % 2 ? `(${expr})` : `'${escape(expr)}'`).join('+'), options)
+      return safeCompile(parsed.map(() => undefined).join('+'), options)
     }
   }
killedBy: compiler text node exposes a bindingsCount property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
punybind.js:31:52
     const parsed = value.split(/{{((?:[^}])+)}}/)
     const escape = str => str.replace(/\\|'/g, match => ({ '\\': '\\\\', '\'': '\\\'' }[match]))
     if (parsed.length > 1) {
-      return safeCompile(parsed.map((expr, idx) => idx % 2 ? `(${expr})` : `'${escape(expr)}'`).join('+'), options)
+      return safeCompile(parsed.map((expr, idx) => idx * 2 ? `(${expr})` : `'${escape(expr)}'`).join('+'), options)
     }
   }
killedBy: text node text mixes static and dynamic content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Title is Hello World !."
Received: "Title is {{ title }}."

[Killed] ArrowFunction
punybind.js:38:16
   const ELEMENT_NODE = 1
   const TEXT_NODE = 3
 
-  const attr = (node, name) => node.getAttribute(name)
+  const attr = () => undefined
   const array = arrayLike => Array.prototype.slice.call(arrayLike)
 
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ArrowFunction
punybind.js:39:17
   const TEXT_NODE = 3
 
   const attr = (node, name) => node.getAttribute(name)
-  const array = arrayLike => Array.prototype.slice.call(arrayLike)
+  const array = () => undefined
 
   const bindTextNode = (node, bindings, options) => {
killedBy: iterators {{for}} ignores invalid syntax: <div {{for}}="" />
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BlockStatement
punybind.js:41:53
   const attr = (node, name) => node.getAttribute(name)
   const array = arrayLike => Array.prototype.slice.call(arrayLike)
 
-  const bindTextNode = (node, bindings, options) => {
-    const valueFactory = safeCompileComposite(node.nodeValue, options)
-    if (valueFactory) {
-      const parent = node.parentNode
-      let value
-
-      bindings.push((context, changes) => {
-        const newValue = valueFactory(context)
-        if (newValue !== value) {
-          const newChild = parent.ownerDocument.createTextNode(newValue)
-          value = newValue
-          changes.push(() => {
-            parent.replaceChild(newChild, node)
-            node = newChild
-          })
-        }
-      })
-    }
-  }
+  const bindTextNode = (node, bindings, options) => {}
 
   const bindAttribute = (node, name, bindings, options) => {
killedBy: compiler text node exposes a bindingsCount property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
punybind.js:43:23
 
   const bindTextNode = (node, bindings, options) => {
     const valueFactory = safeCompileComposite(node.nodeValue, options)
-    if (valueFactory) {
-      const parent = node.parentNode
-      let value
-
-      bindings.push((context, changes) => {
-        const newValue = valueFactory(context)
-        if (newValue !== value) {
-          const newChild = parent.ownerDocument.createTextNode(newValue)
-          value = newValue
-          changes.push(() => {
-            parent.replaceChild(newChild, node)
-            node = newChild
-          })
-        }
-      })
-    }
+    if (valueFactory) {}
   }
 
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

@@ -5,16 +5,16 @@
          "before",
        ],

[Killed] ConditionalExpression
punybind.js:43:9
 
   const bindTextNode = (node, bindings, options) => {
     const valueFactory = safeCompileComposite(node.nodeValue, options)
-    if (valueFactory) {
+    if (true) {
       const parent = node.parentNode
       let value
killedBy: text node text ignores invalid syntax: Title
statusReason: TypeError: valueFactory is not a function

[Killed] BlockStatement
punybind.js:47:43
       const parent = node.parentNode
       let value
 
-      bindings.push((context, changes) => {
-        const newValue = valueFactory(context)
-        if (newValue !== value) {
-          const newChild = parent.ownerDocument.createTextNode(newValue)
-          value = newValue
-          changes.push(() => {
-            parent.replaceChild(newChild, node)
-            node = newChild
-          })
-        }
-      })
+      bindings.push((context, changes) => {})
     }
   }
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 3

@@ -1,28 +1,28 @@
  Object {
    "body": Array [

[Killed] BlockStatement
punybind.js:49:33
 
       bindings.push((context, changes) => {
         const newValue = valueFactory(context)
-        if (newValue !== value) {
-          const newChild = parent.ownerDocument.createTextNode(newValue)
-          value = newValue
-          changes.push(() => {
-            parent.replaceChild(newChild, node)
-            node = newChild
-          })
-        }
+        if (newValue !== value) {}
       })
     }
killedBy: compiler text node evaluates and injects results
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Title is Hello World !."
Received: "Title is {{ title }}."

[Killed] EqualityOperator
punybind.js:49:13
 
       bindings.push((context, changes) => {
         const newValue = valueFactory(context)
-        if (newValue !== value) {
+        if (newValue === value) {
           const newChild = parent.ownerDocument.createTextNode(newValue)
           value = newValue
killedBy: text node text mixes static and dynamic content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Title is Hello World !."
Received: "Title is {{ title }}."

[Killed] BlockStatement
punybind.js:52:30
         if (newValue !== value) {
           const newChild = parent.ownerDocument.createTextNode(newValue)
           value = newValue
-          changes.push(() => {
-            parent.replaceChild(newChild, node)
-            node = newChild
-          })
+          changes.push(() => {})
         }
       })
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

@@ -5,16 +5,16 @@
          "before",
        ],

[Killed] BlockStatement
punybind.js:61:60
     }
   }
 
-  const bindAttribute = (node, name, bindings, options) => {
-    const valueFactory = safeCompileComposite(attr(node, name), options)
-    if (valueFactory) {
-      let value
-
-      bindings.push((context, changes) => {
-        const newValue = valueFactory(context)
-        if (newValue !== value) {
-          value = newValue
-          changes.push(() => {
-            node.setAttribute(name, newValue)
-          })
-        }
-      })
-    }
-  }
+  const bindAttribute = (node, name, bindings, options) => {}
 
   const getTemplate = (node, attributeName) => {
killedBy: text attribute value mixes static and dynamic content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "background-color: red;"
Received: "background-color: {{ color }};"

[Killed] BlockStatement
punybind.js:63:23
 
   const bindAttribute = (node, name, bindings, options) => {
     const valueFactory = safeCompileComposite(attr(node, name), options)
-    if (valueFactory) {
-      let value
-
-      bindings.push((context, changes) => {
-        const newValue = valueFactory(context)
-        if (newValue !== value) {
-          value = newValue
-          changes.push(() => {
-            node.setAttribute(name, newValue)
-          })
-        }
-      })
-    }
+    if (valueFactory) {}
   }
 
killedBy: text attribute value mixes static and dynamic content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "background-color: red;"
Received: "background-color: {{ color }};"

[Killed] ConditionalExpression
punybind.js:63:9
 
   const bindAttribute = (node, name, bindings, options) => {
     const valueFactory = safeCompileComposite(attr(node, name), options)
-    if (valueFactory) {
+    if (false) {
       let value
 
killedBy: text attribute value mixes static and dynamic content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "background-color: red;"
Received: "background-color: {{ color }};"

[Killed] BlockStatement
punybind.js:66:43
     if (valueFactory) {
       let value
 
-      bindings.push((context, changes) => {
-        const newValue = valueFactory(context)
-        if (newValue !== value) {
-          value = newValue
-          changes.push(() => {
-            node.setAttribute(name, newValue)
-          })
-        }
-      })
+      bindings.push((context, changes) => {})
     }
   }
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

@@ -8,19 +8,19 @@
      Object {
        "ul": Array [

[Killed] ConditionalExpression
punybind.js:68:13
 
       bindings.push((context, changes) => {
         const newValue = valueFactory(context)
-        if (newValue !== value) {
+        if (false) {
           value = newValue
           changes.push(() => {
killedBy: text attribute value mixes static and dynamic content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "background-color: red;"
Received: "background-color: {{ color }};"

[Killed] BlockStatement
punybind.js:68:33
 
       bindings.push((context, changes) => {
         const newValue = valueFactory(context)
-        if (newValue !== value) {
-          value = newValue
-          changes.push(() => {
-            node.setAttribute(name, newValue)
-          })
-        }
+        if (newValue !== value) {}
       })
     }
killedBy: text attribute value mixes static and dynamic content
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "background-color: red;"
Received: "background-color: {{ color }};"

[Killed] BlockStatement
punybind.js:70:30
         const newValue = valueFactory(context)
         if (newValue !== value) {
           value = newValue
-          changes.push(() => {
-            node.setAttribute(name, newValue)
-          })
+          changes.push(() => {})
         }
       })
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

@@ -8,19 +8,19 @@
      Object {
        "ul": Array [

[Killed] BlockStatement
punybind.js:78:48
     }
   }
 
-  const getTemplate = (node, attributeName) => {
-    const parent = node.parentNode
-    const template = node.ownerDocument.createElement('template')
-    parent.insertBefore(template, node)
-    template.appendChild(node)
-    node.removeAttribute(attributeName)
-    return [parent, template]
-  }
+  const getTemplate = (node, attributeName) => {}
 
   const CLONE = 0
killedBy: reactive model model property exposes a model property
statusReason: TypeError: getTemplate is not a function or its return value is not iterable

[Killed] ArrayDeclaration
punybind.js:84:12
     parent.insertBefore(template, node)
     template.appendChild(node)
     node.removeAttribute(attributeName)
-    return [parent, template]
+    return []
   }
 
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot read properties of undefined (reading 'firstChild')

[Killed] BlockStatement
punybind.js:90:55
   const CLONE = 0
   const BINDINGS = 1
 
-  const instantiate = (template, changes, options) => {
-    const clone = template.firstChild.cloneNode(true)
-    changes.push(function () {
-      template.parentNode.insertBefore(clone, template)
-    })
-    return [
-      clone,
-      parse(clone, options)
-    ]
-  }
+  const instantiate = (template, changes, options) => {}
 
   const remove = (parent, instances, changes) => {
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] BooleanLiteral
punybind.js:91:49
   const BINDINGS = 1
 
   const instantiate = (template, changes, options) => {
-    const clone = template.firstChild.cloneNode(true)
+    const clone = template.firstChild.cloneNode(false)
     changes.push(function () {
       template.parentNode.insertBefore(clone, template)
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 0

@@ -10,19 +10,17 @@
          Object {
            "li": Array [

[Killed] BlockStatement
punybind.js:92:30
 
   const instantiate = (template, changes, options) => {
     const clone = template.firstChild.cloneNode(true)
-    changes.push(function () {
-      template.parentNode.insertBefore(clone, template)
-    })
+    changes.push(function () {})
     return [
       clone,
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 3

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:101:50
     ]
   }
 
-  const remove = (parent, instances, changes) => {
-    changes.push(function () {
-      this.forEach(instance => parent.removeChild(instance[CLONE]))
-    }.bind(instances))
-  }
+  const remove = (parent, instances, changes) => {}
 
   const $for = '{{for}}'
killedBy: reactive model reactive behavior array detects list change (pop)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 18

@@ -14,11 +14,28 @@
              },
              "Forget about heavy frameworks",

[Killed] BlockStatement
punybind.js:102:30
   }
 
   const remove = (parent, instances, changes) => {
-    changes.push(function () {
-      this.forEach(instance => parent.removeChild(instance[CLONE]))
-    }.bind(instances))
+    changes.push(function () {}.bind(instances))
   }
 
killedBy: reactive model reactive behavior array detects list change (pop)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 18

@@ -14,11 +14,28 @@
              },
              "Forget about heavy frameworks",

[Killed] ArrowFunction
punybind.js:103:20
 
   const remove = (parent, instances, changes) => {
     changes.push(function () {
-      this.forEach(instance => parent.removeChild(instance[CLONE]))
+      this.forEach(() => undefined)
     }.bind(instances))
   }
killedBy: reactive model reactive behavior array detects list change (pop)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 18

@@ -14,11 +14,28 @@
              },
              "Forget about heavy frameworks",

[Killed] Regex
punybind.js:111:19
 
   const bindIterator = (node, bindings, options) => {
     const forValue = attr(node, $for)
-    const match = /^\s*(\w+)(?:\s*,\s*(\w+))?\s+of\s(.*)/.exec(forValue)
+    const match = /^\s*(\w)(?:\s*,\s*(\w+))?\s+of\s(.*)/.exec(forValue)
     if (!match) {
       return
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 13
+ Received  +  3

@@ -8,25 +8,15 @@
      Object {
        "ul": Array [

[Killed] Regex
punybind.js:111:19
 
   const bindIterator = (node, bindings, options) => {
     const forValue = attr(node, $for)
-    const match = /^\s*(\w+)(?:\s*,\s*(\w+))?\s+of\s(.*)/.exec(forValue)
+    const match = /^\s*(\w+)(?:\s*,\s(\w+))?\s+of\s(.*)/.exec(forValue)
     if (!match) {
       return
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}="item,index of items" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
punybind.js:112:9
   const bindIterator = (node, bindings, options) => {
     const forValue = attr(node, $for)
     const match = /^\s*(\w+)(?:\s*,\s*(\w+))?\s+of\s(.*)/.exec(forValue)
-    if (!match) {
+    if (false) {
       return
     }
killedBy: iterators {{for}} ignores invalid syntax: <div {{for}}="item" />
statusReason: TypeError: match is not iterable

[Killed] BooleanLiteral
punybind.js:112:9
   const bindIterator = (node, bindings, options) => {
     const forValue = attr(node, $for)
     const match = /^\s*(\w+)(?:\s*,\s*(\w+))?\s+of\s(.*)/.exec(forValue)
-    if (!match) {
+    if (match) {
       return
     }
killedBy: iterators {{for}} ignores invalid syntax: <div {{for}}="item" />
statusReason: TypeError: match is not iterable

[Killed] ConditionalExpression
punybind.js:117:9
     }
     const [, valueName, indexName, iterator] = match
     const iteratorFactory = safeCompile(iterator, options)
-    if (!iteratorFactory) {
+    if (false) {
       return
     }
killedBy: iterators {{for}} ignores invalid syntax: <div {{for}}="item, index of ()" />
statusReason: TypeError: iteratorFactory is not a function

[Killed] BooleanLiteral
punybind.js:117:9
     }
     const [, valueName, indexName, iterator] = match
     const iteratorFactory = safeCompile(iterator, options)
-    if (!iteratorFactory) {
+    if (iteratorFactory) {
       return
     }
killedBy: iterators {{for}} ignores invalid syntax: <div {{for}}="item, index of ()" />
statusReason: TypeError: iteratorFactory is not a function

[Killed] UnaryOperator
punybind.js:126:19
 
     bindings.push(async (context, changes) => {
       const iterator = iteratorFactory(context)
-      let index = -1
+      let index = +1
       for await (const item of iterator) {
         ++index
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

@@ -5,16 +5,16 @@
          "before",
        ],

[Killed] BlockStatement
punybind.js:127:42
     bindings.push(async (context, changes) => {
       const iterator = iteratorFactory(context)
       let index = -1
-      for await (const item of iterator) {
-        ++index
-
-        if (index === instances.length) {
-          instances.push(instantiate(template, changes, options))
-        }
-
-        await collectChanges(
-          instances[index][BINDINGS],
-          {
-            ...context,
-            [valueName]: item,
-            [indexName]: index
-          },
-          changes
-        )
-      }
+      for await (const item of iterator) {}
 
       ++index
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 7
+ Received  + 3

@@ -4,21 +4,17 @@
        "h1": Array [
          "before",

[Killed] UpdateOperator
punybind.js:128:9
       const iterator = iteratorFactory(context)
       let index = -1
       for await (const item of iterator) {
-        ++index
+        --index
 
         if (index === instances.length) {
killedBy: iterators {{for}} enables list rendering
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
punybind.js:130:13
       for await (const item of iterator) {
         ++index
 
-        if (index === instances.length) {
+        if (false) {
           instances.push(instantiate(template, changes, options))
         }
killedBy: iterators {{for}} enables list rendering
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
punybind.js:130:13
       for await (const item of iterator) {
         ++index
 
-        if (index === instances.length) {
+        if (true) {
           instances.push(instantiate(template, changes, options))
         }
killedBy: reactive model reactive behavior updates when changing a property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 4

[Killed] ObjectLiteral
punybind.js:136:11
 
         await collectChanges(
           instances[index][BINDINGS],
-          {
-            ...context,
-            [valueName]: item,
-            [indexName]: index
-          },
+          {},
           changes
         )
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 6
+ Received  + 2

@@ -4,18 +4,14 @@
        "h1": Array [
          "before",
