[Killed] UpdateOperator
punybind.js:145:7
         )
       }
 
-      ++index
+      --index
 
       remove(parent, instances.slice(index), changes)
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}=" item of items" />
statusReason: RangeError: Invalid array length

[Killed] MethodExpression
punybind.js:147:22
 
       ++index
 
-      remove(parent, instances.slice(index), changes)
+      remove(parent, instances, changes)
       instances.length = index
     })
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 11
+ Received  +  4

@@ -6,27 +6,20 @@
        ],
      },

[Killed] StringLiteral
punybind.js:152:15
     })
   }
 
-  const $if = '{{if}}'
+  const $if = ""
   const $elseif = '{{elseif}}'
   const $else = '{{else}}'
killedBy: compiler conditional generates only one binding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
punybind.js:160:9
 
   const bindConditional = (node, bindings, options) => {
     const valueFactory = safeCompile(attr(node, $if), options)
-    if (!valueFactory) {
+    if (true) {
       return
     }
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 6

@@ -4,11 +4,16 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:160:24
 
   const bindConditional = (node, bindings, options) => {
     const valueFactory = safeCompile(attr(node, $if), options)
-    if (!valueFactory) {
-      return
-    }
+    if (!valueFactory) {}
 
     const [parent, template] = getTemplate(node, $if)
killedBy: conditional {{if}} ignores invalid syntax: <div {{if}}="-" />
statusReason: TypeError: valueFactory is not a function

[Killed] ArrayDeclaration
punybind.js:166:31
 
     const [parent, template] = getTemplate(node, $if)
 
-    const conditionalChain = [[valueFactory, template]]
+    const conditionalChain = [[]]
 
     const elements = array(parent.childNodes).filter(child => child.nodeType === ELEMENT_NODE)
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: valueFactory is not a function

[Killed] EqualityOperator
punybind.js:168:63
 
     const conditionalChain = [[valueFactory, template]]
 
-    const elements = array(parent.childNodes).filter(child => child.nodeType === ELEMENT_NODE)
+    const elements = array(parent.childNodes).filter(child => child.nodeType !== ELEMENT_NODE)
     const nodePos = elements.findIndex(element => element === template)
     const siblings = elements.slice(nodePos + 1)
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: node.getAttribute is not a function

[Killed] ConditionalExpression
punybind.js:168:63
 
     const conditionalChain = [[valueFactory, template]]
 
-    const elements = array(parent.childNodes).filter(child => child.nodeType === ELEMENT_NODE)
+    const elements = array(parent.childNodes).filter(child => true)
     const nodePos = elements.findIndex(element => element === template)
     const siblings = elements.slice(nodePos + 1)
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: node.getAttribute is not a function

[Killed] ArrowFunction
punybind.js:169:40
     const conditionalChain = [[valueFactory, template]]
 
     const elements = array(parent.childNodes).filter(child => child.nodeType === ELEMENT_NODE)
-    const nodePos = elements.findIndex(element => element === template)
+    const nodePos = elements.findIndex(() => undefined)
     const siblings = elements.slice(nodePos + 1)
 
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  3
+ Received  + 18

@@ -7,17 +7,32 @@
      },
      Object {

[Killed] ConditionalExpression
punybind.js:169:51
     const conditionalChain = [[valueFactory, template]]
 
     const elements = array(parent.childNodes).filter(child => child.nodeType === ELEMENT_NODE)
-    const nodePos = elements.findIndex(element => element === template)
+    const nodePos = elements.findIndex(element => true)
     const siblings = elements.slice(nodePos + 1)
 
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  3
+ Received  + 18

@@ -7,17 +7,32 @@
      },
      Object {

[Killed] ArithmeticOperator
punybind.js:170:37
 
     const elements = array(parent.childNodes).filter(child => child.nodeType === ELEMENT_NODE)
     const nodePos = elements.findIndex(element => element === template)
-    const siblings = elements.slice(nodePos + 1)
+    const siblings = elements.slice(nodePos - 1)
 
     siblings.every(nextSibling => {
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  3
+ Received  + 18

@@ -7,17 +7,32 @@
      },
      Object {

[Killed] MethodExpression
punybind.js:170:22
 
     const elements = array(parent.childNodes).filter(child => child.nodeType === ELEMENT_NODE)
     const nodePos = elements.findIndex(element => element === template)
-    const siblings = elements.slice(nodePos + 1)
+    const siblings = elements
 
     siblings.every(nextSibling => {
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  3
+ Received  + 18

@@ -7,17 +7,32 @@
      },
      Object {

[Killed] MethodExpression
punybind.js:172:5
     const nodePos = elements.findIndex(element => element === template)
     const siblings = elements.slice(nodePos + 1)
 
-    siblings.every(nextSibling => {
-      const elseIf = attr(nextSibling, $elseif)
-      if (elseIf) {
-        const eiValueFactory = safeCompile(elseIf, options)
-        if (!eiValueFactory) {
-          return false
-        }
-        const [, eiTemplate] = getTemplate(nextSibling, $elseif)
-        conditionalChain.push([eiValueFactory, eiTemplate])
-        nextSibling = eiTemplate.nextElementSibling
-      } else {
-        if (nextSibling.hasAttribute($else)) {
-          const [, eiTemplate] = getTemplate(nextSibling, $else)
-          conditionalChain.push([() => true, eiTemplate])
-        }
-        return false
-      }
-      return true
-    })
+    siblings.some(nextSibling => {
+  const elseIf = attr(nextSibling, $elseif);
+  if (elseIf) {
+    const eiValueFactory = safeCompile(elseIf, options);
+    if (!eiValueFactory) {
+      return false;
+    }
+    const [, eiTemplate] = getTemplate(nextSibling, $elseif);
+    conditionalChain.push([eiValueFactory, eiTemplate]);
+    nextSibling = eiTemplate.nextElementSibling;
+  } else {
+    if (nextSibling.hasAttribute($else)) {
+      const [, eiTemplate] = getTemplate(nextSibling, $else);
+      conditionalChain.push([() => true, eiTemplate]);
+    }
+    return false;
+  }
+  return true;
+})
 
     bindings.push(async (context, changes) => {
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  2
+ Received  + 12

@@ -10,14 +10,24 @@
      },
      Object {

[Killed] BlockStatement
punybind.js:172:35
     const nodePos = elements.findIndex(element => element === template)
     const siblings = elements.slice(nodePos + 1)
 
-    siblings.every(nextSibling => {
-      const elseIf = attr(nextSibling, $elseif)
-      if (elseIf) {
-        const eiValueFactory = safeCompile(elseIf, options)
-        if (!eiValueFactory) {
-          return false
-        }
-        const [, eiTemplate] = getTemplate(nextSibling, $elseif)
-        conditionalChain.push([eiValueFactory, eiTemplate])
-        nextSibling = eiTemplate.nextElementSibling
-      } else {
-        if (nextSibling.hasAttribute($else)) {
-          const [, eiTemplate] = getTemplate(nextSibling, $else)
-          conditionalChain.push([() => true, eiTemplate])
-        }
-        return false
-      }
-      return true
-    })
+    siblings.every(nextSibling => {})
 
     bindings.push(async (context, changes) => {
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  3
+ Received  + 18

@@ -7,17 +7,32 @@
      },
      Object {

[Killed] ConditionalExpression
punybind.js:174:11
 
     siblings.every(nextSibling => {
       const elseIf = attr(nextSibling, $elseif)
-      if (elseIf) {
+      if (false) {
         const eiValueFactory = safeCompile(elseIf, options)
         if (!eiValueFactory) {
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  3
+ Received  + 18

@@ -7,17 +7,32 @@
      },
      Object {

[Killed] BlockStatement
punybind.js:174:19
 
     siblings.every(nextSibling => {
       const elseIf = attr(nextSibling, $elseif)
-      if (elseIf) {
-        const eiValueFactory = safeCompile(elseIf, options)
-        if (!eiValueFactory) {
-          return false
-        }
-        const [, eiTemplate] = getTemplate(nextSibling, $elseif)
-        conditionalChain.push([eiValueFactory, eiTemplate])
-        nextSibling = eiTemplate.nextElementSibling
-      } else {
+      if (elseIf) {} else {
         if (nextSibling.hasAttribute($else)) {
           const [, eiTemplate] = getTemplate(nextSibling, $else)
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  3
+ Received  + 18

@@ -7,17 +7,32 @@
      },
      Object {

[Killed] ConditionalExpression
punybind.js:176:13
       const elseIf = attr(nextSibling, $elseif)
       if (elseIf) {
         const eiValueFactory = safeCompile(elseIf, options)
-        if (!eiValueFactory) {
+        if (false) {
           return false
         }
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}="-"></div>
statusReason: TypeError: valueFactory is not a function

[Killed] BlockStatement
punybind.js:176:30
       const elseIf = attr(nextSibling, $elseif)
       if (elseIf) {
         const eiValueFactory = safeCompile(elseIf, options)
-        if (!eiValueFactory) {
-          return false
-        }
+        if (!eiValueFactory) {}
         const [, eiTemplate] = getTemplate(nextSibling, $elseif)
         conditionalChain.push([eiValueFactory, eiTemplate])
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}="-"></div>
statusReason: TypeError: valueFactory is not a function

[Killed] BooleanLiteral
punybind.js:177:18
       if (elseIf) {
         const eiValueFactory = safeCompile(elseIf, options)
         if (!eiValueFactory) {
-          return false
+          return true
         }
         const [, eiTemplate] = getTemplate(nextSibling, $elseif)
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}="-"></div><div {{elseif}}="true"></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 5

@@ -9,13 +9,16 @@
            "@{{elseif}}": "-",
          },

[Killed] ArrayDeclaration
punybind.js:180:31
           return false
         }
         const [, eiTemplate] = getTemplate(nextSibling, $elseif)
-        conditionalChain.push([eiValueFactory, eiTemplate])
+        conditionalChain.push([])
         nextSibling = eiTemplate.nextElementSibling
       } else {
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: TypeError: valueFactory is not a function

[Killed] BlockStatement
punybind.js:182:14
         const [, eiTemplate] = getTemplate(nextSibling, $elseif)
         conditionalChain.push([eiValueFactory, eiTemplate])
         nextSibling = eiTemplate.nextElementSibling
-      } else {
-        if (nextSibling.hasAttribute($else)) {
-          const [, eiTemplate] = getTemplate(nextSibling, $else)
-          conditionalChain.push([() => true, eiTemplate])
-        }
-        return false
-      }
+      } else {}
       return true
     })
killedBy: conditional {{if}} {{if}} / {{elseif}} ignores invalid syntax: <div {{if}}="condition"></div><div {{elseif}}=""></div>
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 8

@@ -22,13 +22,19 @@
          "after",
        ],

[Killed] BlockStatement
punybind.js:183:46
         conditionalChain.push([eiValueFactory, eiTemplate])
         nextSibling = eiTemplate.nextElementSibling
       } else {
-        if (nextSibling.hasAttribute($else)) {
-          const [, eiTemplate] = getTemplate(nextSibling, $else)
-          conditionalChain.push([() => true, eiTemplate])
-        }
+        if (nextSibling.hasAttribute($else)) {}
         return false
       }
killedBy: conditional {{if}} {{if}} / {{else}} generates only one binding
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 3

@@ -8,15 +8,15 @@
      Object {
        "template": Anything,

[Killed] ConditionalExpression
punybind.js:183:13
         conditionalChain.push([eiValueFactory, eiTemplate])
         nextSibling = eiTemplate.nextElementSibling
       } else {
-        if (nextSibling.hasAttribute($else)) {
+        if (false) {
           const [, eiTemplate] = getTemplate(nextSibling, $else)
           conditionalChain.push([() => true, eiTemplate])
killedBy: conditional {{if}} {{if}} / {{else}} generates only one binding
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 3

@@ -8,15 +8,15 @@
      Object {
        "template": Anything,

[Killed] BooleanLiteral
punybind.js:185:40
       } else {
         if (nextSibling.hasAttribute($else)) {
           const [, eiTemplate] = getTemplate(nextSibling, $else)
-          conditionalChain.push([() => true, eiTemplate])
+          conditionalChain.push([() => false, eiTemplate])
         }
         return false
killedBy: conditional {{if}} {{if}} / {{else}} generates only one binding
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 3

@@ -7,16 +7,17 @@
      },
      Object {

[Killed] ArrowFunction
punybind.js:185:34
       } else {
         if (nextSibling.hasAttribute($else)) {
           const [, eiTemplate] = getTemplate(nextSibling, $else)
-          conditionalChain.push([() => true, eiTemplate])
+          conditionalChain.push([() => undefined, eiTemplate])
         }
         return false
killedBy: conditional {{if}} {{if}} / {{else}} generates only one binding
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 3

@@ -7,16 +7,17 @@
      },
      Object {

[Killed] BlockStatement
punybind.js:192:47
       return true
     })
 
-    bindings.push(async (context, changes) => {
-      let searchTrueCondition = true
-      const instancesToRemove = []
-      for (const condition of conditionalChain) {
-        const [valueFactory, template, instance] = condition
-
-        const value = searchTrueCondition && valueFactory(context)
-        if (value) {
-          searchTrueCondition = false
-          if (!instance) {
-            condition[INSTANCE] = instantiate(template, changes, options)
-          }
-          await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
-          instancesToRemove.push(instance)
-          condition[INSTANCE] = undefined
-        }
-      }
-      remove(parent, instancesToRemove, changes)
-    })
+    bindings.push(async (context, changes) => {})
   }
 
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 3

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] BooleanLiteral
punybind.js:193:33
     })
 
     bindings.push(async (context, changes) => {
-      let searchTrueCondition = true
+      let searchTrueCondition = false
       const instancesToRemove = []
       for (const condition of conditionalChain) {
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 3

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] ArrayDeclaration
punybind.js:194:33
 
     bindings.push(async (context, changes) => {
       let searchTrueCondition = true
-      const instancesToRemove = []
+      const instancesToRemove = ["Stryker was here"]
       for (const condition of conditionalChain) {
         const [valueFactory, template, instance] = condition
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: Failed to execute 'removeChild' on 'Node': parameter 1 is not of type 'Node'.

[Killed] BlockStatement
punybind.js:195:49
     bindings.push(async (context, changes) => {
       let searchTrueCondition = true
       const instancesToRemove = []
-      for (const condition of conditionalChain) {
-        const [valueFactory, template, instance] = condition
-
-        const value = searchTrueCondition && valueFactory(context)
-        if (value) {
-          searchTrueCondition = false
-          if (!instance) {
-            condition[INSTANCE] = instantiate(template, changes, options)
-          }
-          await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
-          instancesToRemove.push(instance)
-          condition[INSTANCE] = undefined
-        }
-      }
+      for (const condition of conditionalChain) {}
       remove(parent, instancesToRemove, changes)
     })
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 3

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] ConditionalExpression
punybind.js:198:23
       for (const condition of conditionalChain) {
         const [valueFactory, template, instance] = condition
 
-        const value = searchTrueCondition && valueFactory(context)
+        const value = true
         if (value) {
           searchTrueCondition = false
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 12

@@ -4,11 +4,22 @@
        "h1": Array [
          "before",

[Killed] LogicalOperator
punybind.js:198:23
       for (const condition of conditionalChain) {
         const [valueFactory, template, instance] = condition
 
-        const value = searchTrueCondition && valueFactory(context)
+        const value = searchTrueCondition || valueFactory(context)
         if (value) {
           searchTrueCondition = false
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 12

@@ -4,11 +4,22 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:199:20
         const [valueFactory, template, instance] = condition
 
         const value = searchTrueCondition && valueFactory(context)
-        if (value) {
-          searchTrueCondition = false
-          if (!instance) {
-            condition[INSTANCE] = instantiate(template, changes, options)
-          }
-          await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
+        if (value) {} else if (instance) {
           instancesToRemove.push(instance)
           condition[INSTANCE] = undefined
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 3

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] ConditionalExpression
punybind.js:199:13
         const [valueFactory, template, instance] = condition
 
         const value = searchTrueCondition && valueFactory(context)
-        if (value) {
+        if (false) {
           searchTrueCondition = false
           if (!instance) {
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 3

@@ -4,16 +4,17 @@
        "h1": Array [
          "before",

[Killed] BooleanLiteral
punybind.js:200:33
 
         const value = searchTrueCondition && valueFactory(context)
         if (value) {
-          searchTrueCondition = false
+          searchTrueCondition = true
           if (!instance) {
             condition[INSTANCE] = instantiate(template, changes, options)
killedBy: conditional {{if}} {{if}} / {{elseif}} skipping condition remainder on first truthy condition processes only second condition
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 12

@@ -15,14 +15,25 @@
      },
      Object {

[Killed] BlockStatement
punybind.js:201:26
         const value = searchTrueCondition && valueFactory(context)
         if (value) {
           searchTrueCondition = false
-          if (!instance) {
-            condition[INSTANCE] = instantiate(template, changes, options)
-          }
+          if (!instance) {}
           await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
         } else if (instance) {
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] BooleanLiteral
punybind.js:201:15
         const value = searchTrueCondition && valueFactory(context)
         if (value) {
           searchTrueCondition = false
-          if (!instance) {
+          if (instance) {
             condition[INSTANCE] = instantiate(template, changes, options)
           }
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
punybind.js:205:20
             condition[INSTANCE] = instantiate(template, changes, options)
           }
           await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
+        } else if (true) {
           instancesToRemove.push(instance)
           condition[INSTANCE] = undefined
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
punybind.js:205:30
             condition[INSTANCE] = instantiate(template, changes, options)
           }
           await collectChanges(condition[INSTANCE][BINDINGS], context, changes)
-        } else if (instance) {
-          instancesToRemove.push(instance)
-          condition[INSTANCE] = undefined
-        }
+        } else if (instance) {}
       }
       remove(parent, instancesToRemove, changes)
killedBy: conditional {{if}} {{if}} only switching true -> false : removes the instance
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  -  1
+ Received  + 12

@@ -4,11 +4,22 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:217:30
   const parse = (root, options) => {
     const bindings = []
 
-    const traverse = node => {
-      if (node.nodeType === TEXT_NODE) {
-        bindTextNode(node, bindings, options)
-      }
-      if (node.nodeType === ELEMENT_NODE) {
-        if (attr(node, $for)) {
-          bindIterator(node, bindings, options)
-          return
-        }
-        if (attr(node, $if)) {
-          bindConditional(node, bindings, options)
-          return
-        }
-        for (const attr of node.attributes) {
-          bindAttribute(node, attr.name, bindings, options)
-        }
-        array(node.childNodes).forEach(traverse)
-      }
-    }
+    const traverse = node => {}
 
     traverse(root)
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}=" item of items" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
punybind.js:218:11
     const bindings = []
 
     const traverse = node => {
-      if (node.nodeType === TEXT_NODE) {
+      if (false) {
         bindTextNode(node, bindings, options)
       }
killedBy: compiler text node exposes a bindingsCount property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
punybind.js:218:11
     const bindings = []
 
     const traverse = node => {
-      if (node.nodeType === TEXT_NODE) {
+      if (true) {
         bindTextNode(node, bindings, options)
       }
killedBy: iterators {{for}} ignores invalid syntax: <div {{for}}="" />
statusReason: TypeError: Cannot read properties of null (reading 'split')

[Killed] EqualityOperator
punybind.js:221:11
       if (node.nodeType === TEXT_NODE) {
         bindTextNode(node, bindings, options)
       }
-      if (node.nodeType === ELEMENT_NODE) {
+      if (node.nodeType !== ELEMENT_NODE) {
         if (attr(node, $for)) {
           bindIterator(node, bindings, options)
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}=" item of items" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
punybind.js:221:43
       if (node.nodeType === TEXT_NODE) {
         bindTextNode(node, bindings, options)
       }
-      if (node.nodeType === ELEMENT_NODE) {
-        if (attr(node, $for)) {
-          bindIterator(node, bindings, options)
-          return
-        }
-        if (attr(node, $if)) {
-          bindConditional(node, bindings, options)
-          return
-        }
-        for (const attr of node.attributes) {
-          bindAttribute(node, attr.name, bindings, options)
-        }
-        array(node.childNodes).forEach(traverse)
-      }
+      if (node.nodeType === ELEMENT_NODE) {}
     }
 
killedBy: iterators {{for}} accepts valid syntax: <div {{for}}=" item of items" />
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
punybind.js:222:13
         bindTextNode(node, bindings, options)
       }
       if (node.nodeType === ELEMENT_NODE) {
-        if (attr(node, $for)) {
+        if (false) {
           bindIterator(node, bindings, options)
           return
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 13
+ Received  +  2

@@ -8,25 +8,14 @@
      Object {
        "ul": Array [

[Killed] ConditionalExpression
punybind.js:222:13
         bindTextNode(node, bindings, options)
       }
       if (node.nodeType === ELEMENT_NODE) {
-        if (attr(node, $for)) {
+        if (true) {
           bindIterator(node, bindings, options)
           return
killedBy: conditional {{if}} {{if}} only displays on truthy value (true)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 6

@@ -4,11 +4,16 @@
        "h1": Array [
          "before",

[Killed] ConditionalExpression
punybind.js:226:13
           bindIterator(node, bindings, options)
           return
         }
-        if (attr(node, $if)) {
+        if (false) {
           bindConditional(node, bindings, options)
           return
killedBy: compiler conditional generates only one binding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
punybind.js:226:13
           bindIterator(node, bindings, options)
           return
         }
-        if (attr(node, $if)) {
+        if (true) {
           bindConditional(node, bindings, options)
           return
killedBy: reactive model reactive behavior triggers an initial update
statusReason: TypeError: Failed to execute 'observe' on 'MutationObserver': parameter 1 is not of type 'Node'.

[Killed] BlockStatement
punybind.js:230:45
           bindConditional(node, bindings, options)
           return
         }
-        for (const attr of node.attributes) {
-          bindAttribute(node, attr.name, bindings, options)
-        }
+        for (const attr of node.attributes) {}
         array(node.childNodes).forEach(traverse)
       }
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

@@ -8,19 +8,19 @@
      Object {
        "ul": Array [
