[Killed] BlockStatement
punybind.js:242:64
     return bindings
   }
 
-  const collectChanges = async (bindings, context, changes) => {
-    for (const binding of bindings) {
-      await binding(context, changes)
-    }
-  }
+  const collectChanges = async (bindings, context, changes) => {}
 
   const observe = (object, refresh) => {
killedBy: compiler text node evaluates and injects results
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Title is Hello World !."
Received: "Title is {{ title }}."

[Killed] BlockStatement
punybind.js:243:37
   }
 
   const collectChanges = async (bindings, context, changes) => {
-    for (const binding of bindings) {
-      await binding(context, changes)
-    }
+    for (const binding of bindings) {}
   }
 
killedBy: iterators {{for}} enables list rendering
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 7
+ Received  + 3

@@ -4,21 +4,17 @@
        "h1": Array [
          "before",

[Killed] BlockStatement
punybind.js:248:40
     }
   }
 
-  const observe = (object, refresh) => {
-    return new Proxy(object, {
-      get (obj, prop) {
-        const value = obj[prop]
-        const type = typeof value
-        if (type === 'object') {
-          return observe(value, refresh)
-        }
-        return value
-      },
-      set (obj, prop, value) {
-        const previousValue = obj[prop]
-        if (previousValue !== value) {
-          obj[prop] = value
-          refresh()
-        }
-        return true
-      }
-    })
-  }
+  const observe = (object, refresh) => {}
 
   const ro = value => ({
killedBy: reactive model model property exposes a model property
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
punybind.js:250:23
 
   const observe = (object, refresh) => {
     return new Proxy(object, {
-      get (obj, prop) {
-        const value = obj[prop]
-        const type = typeof value
-        if (type === 'object') {
-          return observe(value, refresh)
-        }
-        return value
-      },
+      get (obj, prop) {},
       set (obj, prop, value) {
         const previousValue = obj[prop]
killedBy: reactive model model property exposes a model property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello World !"
Received: undefined

[Killed] EqualityOperator
punybind.js:253:13
       get (obj, prop) {
         const value = obj[prop]
         const type = typeof value
-        if (type === 'object') {
+        if (type !== 'object') {
           return observe(value, refresh)
         }
killedBy: reactive model model property exposes a model property
statusReason: TypeError: Cannot create proxy with a non-object as target or handler

[Killed] BlockStatement
punybind.js:253:32
       get (obj, prop) {
         const value = obj[prop]
         const type = typeof value
-        if (type === 'object') {
-          return observe(value, refresh)
-        }
+        if (type === 'object') {}
         return value
       },
killedBy: reactive model reactive behavior array detects item change
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -8,11 +8,11 @@
      Object {
        "ul": Array [

[Killed] BlockStatement
punybind.js:258:30
         }
         return value
       },
-      set (obj, prop, value) {
-        const previousValue = obj[prop]
-        if (previousValue !== value) {
-          obj[prop] = value
-          refresh()
-        }
-        return true
-      }
+      set (obj, prop, value) {}
     })
   }
killedBy: reactive model reactive behavior updates when changing a property
statusReason: TypeError: 'set' on proxy: trap returned falsish for property 'title'

[Killed] ConditionalExpression
punybind.js:260:13
       },
       set (obj, prop, value) {
         const previousValue = obj[prop]
-        if (previousValue !== value) {
+        if (false) {
           obj[prop] = value
           refresh()
killedBy: reactive model reactive behavior updates when changing a property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
punybind.js:260:38
       },
       set (obj, prop, value) {
         const previousValue = obj[prop]
-        if (previousValue !== value) {
-          obj[prop] = value
-          refresh()
-        }
+        if (previousValue !== value) {}
         return true
       }
killedBy: reactive model reactive behavior updates when changing a property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
punybind.js:271:15
 
   const ro = value => ({
     value,
-    writable: false
+    writable: true
   })
 
killedBy: version is readonly
statusReason: Error: expect(received).toThrowError()

Received function did not throw

[Timeout] BlockStatement
punybind.js:292:35
     let failed
     let lastContext
 
-    const debounced = async () => {
-      try {
-        const changes = []
-        await collectChanges(bindings, lastContext, changes)
-        for (const change of changes) {
-          await change()
-        }
-        lastContext = undefined
-        succeeded(changes.length)
-      } catch (reason) {
-        failed(reason)
-      }
-    }
+    const debounced = async () => {}
 
     const update = async (context) => {

[Timeout] BlockStatement
punybind.js:293:11
     let lastContext
 
     const debounced = async () => {
-      try {
-        const changes = []
-        await collectChanges(bindings, lastContext, changes)
-        for (const change of changes) {
-          await change()
-        }
-        lastContext = undefined
-        succeeded(changes.length)
-      } catch (reason) {
+      try {} catch (reason) {
         failed(reason)
       }

[Killed] BlockStatement
punybind.js:296:39
       try {
         const changes = []
         await collectChanges(bindings, lastContext, changes)
-        for (const change of changes) {
-          await change()
-        }
+        for (const change of changes) {}
         lastContext = undefined
         succeeded(changes.length)
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 12
+ Received  +  5

  Object {
    "body": Array [
      Object {

[Killed] BlockStatement
punybind.js:301:24
         }
         lastContext = undefined
         succeeded(changes.length)
-      } catch (reason) {
-        failed(reason)
-      }
+      } catch (reason) {}
     }
 
killedBy: error ends properly in case of unexpected error
statusReason: Error: Timeout

[Killed] BlockStatement
punybind.js:306:39
       }
     }
 
-    const update = async (context) => {
-      if (lastContext === undefined) {
-        setTimeout(debounced, 0)
-        done = new Promise((resolve, reject) => {
-          succeeded = resolve
-          failed = reject
-        })
-      }
-      lastContext = context
-      return done
-    }
+    const update = async (context) => {}
 
     await update(properties)
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 12
+ Received  +  5

  Object {
    "body": Array [
      Object {

[Killed] ConditionalExpression
punybind.js:307:11
     }
 
     const update = async (context) => {
-      if (lastContext === undefined) {
+      if (true) {
         setTimeout(debounced, 0)
         done = new Promise((resolve, reject) => {
killedBy: reactive model reactive behavior debounces property changes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: {}
Received: serializes to the same string

[Killed] BlockStatement
punybind.js:307:38
     }
 
     const update = async (context) => {
-      if (lastContext === undefined) {
-        setTimeout(debounced, 0)
-        done = new Promise((resolve, reject) => {
-          succeeded = resolve
-          failed = reject
-        })
-      }
+      if (lastContext === undefined) {}
       lastContext = context
       return done
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 12
+ Received  +  5

  Object {
    "body": Array [
      Object {

[Timeout] BlockStatement
punybind.js:309:49
     const update = async (context) => {
       if (lastContext === undefined) {
         setTimeout(debounced, 0)
-        done = new Promise((resolve, reject) => {
-          succeeded = resolve
-          failed = reject
-        })
+        done = new Promise((resolve, reject) => {})
       }
       lastContext = context

[Killed] BlockStatement
punybind.js:319:45
     }
 
     await update(properties)
-    const model = observe(properties, () => {
-      update(properties)
-    })
+    const model = observe(properties, () => {})
 
     assignROProperties(update, {
killedBy: reactive model reactive behavior updates when changing a property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
punybind.js:326:13
     assignROProperties(update, {
       bindingsCount: bindings.length,
       model,
-      done: () => done
+      done: () => undefined
     })
 
killedBy: reactive model reactive behavior updates when changing a property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
punybind.js:336:12
     const instance = punybind.bind(options)
     assignROProperties(instance, {
       version: '0.0.0',
-      use: addOptions => use({
-        ...options,
-        ...addOptions
-      })
+      use: () => undefined
     })
     return instance
killedBy: compiler text node exposes a bindingsCount property
statusReason: TypeError: safepunybind is not a function

[Killed] ObjectLiteral
punybind.js:344:26
     return instance
   }
 
-  exports.punybind = use({
-    compiler: defaultCompiler
-  })
+  exports.punybind = use({})
 }(this))
 
killedBy: reactive model reactive behavior triggers an initial update
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 14
+ Received  +  4

  Object {
    "body": Array [
      Object {
